# ***Mount Drive***

In [1]:
# Mount!
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# ***Load Libraries***

In [2]:
# Import some mainstream Library 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import time 

from numpy import hstack 
from functools import reduce
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

# ***Determine Open/Save Directory***

In [3]:
# Determine the Path and Retrieve the Data
pathDatasets = '/content/drive/My Drive/Colab/Projects - Niagahoster/Datasets/' #Getting Datasets
pathResults = '/content/drive/My Drive/Colab/Projects - Niagahoster/Results/' #Saving Excel, Image, etc

SalesData = pd.read_csv(pathDatasets + 'NH_Technical_Test.csv')
SalesData.tail()

       client_id  invoice_id  ...  total_price discounted_price
89540     259942    881975.0  ...          156            78.00
89541      84615    882013.0  ...          156            78.00
89542     129895    882042.0  ...          216           136.08
89543     259997    882147.0  ...          468           117.00
89544     251782    882187.0  ...          468           102.96

[5 rows x 16 columns]

# ***Count Distint/Count Value per Column***

In [4]:
# Count Distinct
cntDistinct = SalesData.nunique() #Count distict values
cntCount = SalesData.count() #Count only non-null values
cntDistinct = pd.DataFrame(data=cntDistinct)
cntCount = pd.DataFrame(data=cntCount)
cntDistinct['col'], cntCount['col']= cntDistinct.index, cntCount.index

cntMerge = [cntDistinct, cntCount]
cntMerge = reduce(lambda left,right: pd.merge(left,right,on='col',how='left'), cntMerge)
cntMerge = cntMerge[['col', '0_x', '0_y']]
cntMerge.columns = ['col', 'distinct', 'count']
cntMerge

                     col  distinct  count
0              client_id     56211  89545
1             invoice_id     85681  89545
2        invoice_item_id     88890  89545
3         invoice_status         4  89545
4         service_status         5  89545
5             product_id        14  89545
6      monthly_price_usd        14  89545
7               discount       224  89545
8         service_period         6  89545
9            client_task         2  89545
10    invoice_created_at     85060  89545
11       invoice_paid_at     50163  53755
12  service_cancelled_at     18759  21756
13        monthly_period         6  89545
14           total_price        66  89545
15      discounted_price       828  89545

# ***Set the Right Data Type***

In [5]:
# Needed to Measure Total Sales, Revenue, Time Duration, etc
SalesData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89545 entries, 0 to 89544
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   client_id             89545 non-null  int64
 1   invoice_id            89545 non-null  float64
 2   invoice_item_id       89545 non-null  int64
 3   invoice_status        89545 non-null  object
 4   service_status        89545 non-null  object
 5   product_id            89545 non-null  int64
 6   monthly_price_usd     89545 non-null  int64
 7   discount              89545 non-null  float64
 8   service_period        89545 non-null  object
 9   client_task           89545 non-null  object
 10  invoice_created_at    89545 non-null  object
 11  invoice_paid_at       53755 non-null  object
 12  service_cancelled_at  21756 non-null  object
 13  monthly_period        89545 non-null  int64
 14  total_price           89545 non-null  int64
 15  discounted_price      89545 non-null  float64
dtypes: float64(3), int64(6), object(7)
memory usage: 10.9+ MB

In [6]:
# Set the Right Data Type for the Wrong One, Exclue Date
SalesData['client_id'] = SalesData['client_id'].astype('object')
SalesData['invoice_id'] = SalesData['invoice_id'].astype('object')
SalesData['invoice_item_id'] = SalesData['invoice_item_id'].astype('object')
SalesData['product_id'] = SalesData['product_id'].astype('object')
SalesData['monthly_price_usd'] = SalesData['monthly_price_usd'].astype('float64')
SalesData['total_price'] = SalesData['total_price'].astype('float64')
SalesData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89545 entries, 0 to 89544
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   client_id             89545 non-null  object
 1   invoice_id            89545 non-null  object
 2   invoice_item_id       89545 non-null  object
 3   invoice_status        89545 non-null  object
 4   service_status        89545 non-null  object
 5   product_id            89545 non-null  object
 6   monthly_price_usd     89545 non-null  float64
 7   discount              89545 non-null  float64
 8   service_period        89545 non-null  object
 9   client_task           89545 non-null  object
 10  invoice_created_at    89545 non-null  object
 11  invoice_paid_at       53755 non-null  object
 12  service_cancelled_at  21756 non-null  object
 13  monthly_period        89545 non-null  int64
 14  total_price           89545 non-null  float64
 15  discounted_price      89545 non-null  float64
dtypes: float64(4), int64(1), object(11)
memory usage: 10.9+ MB

In [7]:
# SalesData['invoice_created_at'] = SalesData['invoice_created_at'].astype('datetime64')
# SalesData['invoice_paid_at '] = SalesData['invoice_paid_at '].astype('datetime64')
# SalesData['service_cancelled_at'] = SalesData['service_cancelled_at'].astype('datetime64')

# ***Question A***
Imagine you are working as a data analyst working at company "X". You were asked to make an annual report by the product manager. In order to do that, you need data which you might already have right now. However, you were informed by the data engineer that there was a problem recently in the company's database. As a result, some records are believed to be duplicated and this would create a huge amount of error in your report.  As a data analyst, it is also part of your job to do some data cleaning. Therefore, separate all the duplicated records, count how many of them, and remove them completely from your data so that you can feel confident about the validity of your analysis.

In [8]:
# Get to know the Duplicate: Based on invoice_id & product_id that have same value
SalesDataDuplicate = SalesData[SalesData.duplicated(['invoice_id', 'product_id'])]
SalesDataDuplicate.tail()

      client_id invoice_id  ... total_price discounted_price
89540    259942     881975  ...       156.0            78.00
89541     84615     882013  ...       156.0            78.00
89542    129895     882042  ...       216.0           136.08
89543    259997     882147  ...       468.0           117.00
89544    251782     882187  ...       468.0           102.96

[5 rows x 16 columns]

In [9]:
# Sampling to getting to know the Duplicate, Except First Row
SalesDataDuplicate.loc[SalesDataDuplicate['invoice_id'] == 879438.0] #3
SalesData.loc[SalesData['invoice_id'] == 879438.0] #4

      client_id invoice_id  ... total_price discounted_price
128      247837     879438  ...       468.0           102.96
515      247837     879438  ...       468.0           117.00
51552    247837     879438  ...       468.0           102.96
51553    247837     879438  ...       468.0           117.00

[4 rows x 16 columns]

In [10]:
# Start Cleaning
SalesDataClean = SalesData.drop(list(list(SalesDataDuplicate.index)))
SalesDataClean.tail()

      client_id invoice_id  ... total_price discounted_price
88217    167962     882294  ...        72.0            51.12
88218    154829     882303  ...       216.0           125.28
88219    260103     882308  ...        72.0            48.96
88220    123628     882310  ...       108.0            74.52
88221    167962     882312  ...        72.0            51.12

[5 rows x 16 columns]

In [11]:
# Conclusion in Number
print("So, \nThe number of Records in Raw Sales Data: " + str(len(SalesData))
      + "\nThe number of Records in Duplicated Sales Data: " + str(len(SalesDataDuplicate))
      + "\nThe number of Records in Cleaned Sales Data: " + str(len(SalesDataClean)))

So,
The number of Records in Raw Sales Data: 89545
The number of Records in Duplicated Sales Data: 3718
The number of Records in Cleaned Sales Data: 85827

# ***Question B***
What's the total number of sales along with the total revenue shared from each product? <br> Arrange the result by the total revenue in descending order.

In [12]:
# Status Exploration
print(SalesData.invoice_status.unique())
print(SalesData.service_status.unique())

['Paid' 'Refunded' 'Cancelled' 'Unpaid']
['Active' 'Suspended' 'Cancelled' 'Failed Setup' 'Pending Setup']

For Question B up to Question F we need to eliminate All the Records with invoice_status Refunded, Cancelled, Unpaid since we can't do sales analysis if the customer itself has not bought a Product

In [42]:
# Start eliminating those who hass not Bought or not in PAID invoice_status
SalesDataCleanPaid = SalesDataClean.loc[SalesDataClean['invoice_status'] == 'Paid']
SalesDataCleanPaid.tail()

      client_id invoice_id  ... total_price discounted_price
52423     74461     876940  ...       468.0           234.00
52426     15425     880099  ...       156.0            78.00
52427     50642     877841  ...       156.0            78.00
52429     69925     881656  ...        49.0            43.61
78426    235710     798135  ...       156.0            78.00

[5 rows x 16 columns]

In [40]:
# Start count total number of sales along with the total revenue per Product_ID
cntSalesRevenue = SalesDataCleanPaid.groupby('product_id').agg({'invoice_id':'count', 'discounted_price': 'sum'}).reset_index()
cntSalesRevenue.columns = ['product_id', 'countSales', 'sumRevenue']
cntSalesRevenue = cntSalesRevenue.sort_values('sumRevenue', ascending=False).reset_index(drop=True)
cntSalesRevenue.index += 1
cntSalesRevenue

    product_id  countSales  sumRevenue
1            3       21890  1983103.20
2            4        6228   857670.12
3            2        9298   676050.84
4            1        3641   188992.08
5           11        1588   187125.51
6            7         481   143920.00
7           12        1010   142894.78
8           14         560   141798.06
9           10        1302    94813.88
10           9        2580    92866.75
11           5         744    67676.64
12          13         286    54249.40
13           6         287    33974.84
14           8          71    15793.88

# ***Question C***
The company is planning to give free vouchers to its loyal customers at the end of the year. <br> How do you define "loyal" in this case and explain why? <br> List 100 customers who are eligible to get free vouchers based on your definition of "loyal".

# ***Question D***
What's the average time duration for clients to complete their payments? <br> Hint: you may want to check the distribution of all those time durations to choose a correct central-tendency measure

# ***Question E***
How would you segment the company's customers based on their purchase history? <br> While you are allowed to use your own intuition, you should always support your argument using the data available.

# ***Question F***
Explore the data. State your interesting findings as well as recommendation (if any) to the product team.